<?php
// Перевірка, чи HTTP-запит відбувається методом POST і чи була відправлена форма з елементом 'result-name'
if ($_SERVER["REQUEST_METHOD"] == "POST" && isset($_POST['result-name'])) {
    // Отримання значення з елемента 'location-file' масиву $_POST, якщо він існує, інакше використовується пустий рядок
    $file_location = $_POST['location-file'] ?? '';

    if (empty($file_location)) { echo "Рядок порожній"; }   // Рядок порожній
    // Отримання інформації про шлях до файлу, зокрема, розширення файлу, ім'я без розширення тощо
    $path_info = pathinfo($file_location);

    // Виведення імені файлу без розширення, отриманого з інформації про шлях до файлу
    echo "Ім'я файлу без розширення: " . $path_info['filename'];
}